Revit 2021.1 API
Alignment.GetVCurveNormalAtStation Method
 Calculate 2d (X and Y components of returned vector) vertical normal at given station.
Namespace: Autodesk.Revit.DB.Infrastructure
Assembly: Autodesk.CivilAlignments.DBApplication (in Autodesk.CivilAlignments.DBApplication.dll) Version: 21.0.0.0 (21.1.1.109)
Since: 2021.1
Syntax
C#
public XYZ GetVCurveNormalAtStation(
	double station
)
Visual Basic
Public Function GetVCurveNormalAtStation ( _
	station As Double _
) As XYZ
Visual C++
public:
XYZ^ GetVCurveNormalAtStation(
	double station
)
Parameters
station
Type: System.Double
Alignment station to calculate 2d vertical normal for.
Return Value
2d (X and Y components of returned vector) vertical normal at given station.
See Also
Alignment Class
Autodesk.Revit.DB.Infrastructure Namespace